app/Http/Controllers/JobController.php

select * from "tags"
---
    public function index()
    {
        // $jobs = Job::with('tags','employer')->groupBy('featured');
        $jobs = Job::all()->groupBy('featured');

        return view('jobs.index', [
            'featuredJobs' => $jobs[0],
            'jobs' => $jobs[1],
            'tags' => Tag::all(),
        ]);